<?php include 'header.php';?>

    <div class="heading" style="background-image: url(images/headlines.jpg)";>
        <h1>حلقه for</h1>
    </div>

    <!-- comment section -->

    <section class="main-content">
        <div class="content">
            <p>در این آموزش به کمک مثال های مختلف با مبحث حلقه ها و حلقه for در جاوا اسکریپت (JavaScript) آشنا خواهید شد. در برنامه نویسی از حلقه ها برای تکرار اجرای مجموعه ای از کدها استفاده می شود.</p>
            <p>به عنوان مثال اگر می خواهید یک پیام را ۱۰۰ بار نشان دهید می توانید از یک حلقه استفاده کنید. این فقط یک مثال ساده است، به کمک حلقه ها کارهای زیادی می توانید انجام دهید.</p>
            <p>این آموزش بر روی حلقه for در جاوا اسکریپت تمرکز دارد. در آموزش های آینده با انواع دیگر حلقه آشنا خواهید شد.</p>
            <h1>حلقه for در جاوا اسکریپت</h1>
            <h1>ساختار حلقه for</h1>
            <div class="code">
                <p>for(عبارت اولیه; شرط; عبارت به روز رسانی) { <br>
                
                // for بدنه حلقه <br>
                
                }</p>
            </div>
            <h1>مراحل حلقه for</h1>
            <p>۱- در قسمت عبارت اولیه، متغیرها تعریف یا مقداردهی اولیه می شوند. این قسمت تنها یکبار و در شروع تکرار اول حلقه اجرا می شود.</p>
            <p>۲- سپس شرط بررسی می شود:</p>
            <ul><li>اگر شرط نادرست یا برقرار نباشد، تکرار حلقه for تمام می شود.</li>
            <li>اگر شرط درست و برقرار باشد، بلوک کد داخل حلقه for اجرا می شود.</li></ul>
            <p>۳- در ادامه پس از درست بودن شرط و اجرای کد داخل حلقه، عبارت به روز رسانی قسمت عبارت اولیه را به روز رسانی می کند.</p>
            <p>۴- پس از به روزرسانی، شرط دوباره ارزیابی می شود. این روند تا زمانی ادامه می یابد که شرط نادرست شود و مقدار false برگرداند.</p>
            <p>برای کسب اطلاعات بیشتر درباره عبارت های شرطی می توانید به مبحث آموزش عملگرهای مقایسه ای و منطقی مراجعه کنید.</p>
            <h1>جریان حلقه for با نمودار:</h1>
            <div class="image">
            <img src="images/img7.jpg" alt=""></div>
            <p>مثال۱: تکرار نمایش یک متن</p>
            <div class="code">
                <p>// متن را ۵ بار نمایش می دهد <br>
                
                let n = 5; <br>
                
                // تا ۵ تکرار می شود i = 1 حلقه از <br>
                
                for (let i = 1; i <= n; i++) { <br>
                
                console.log(`I love JavaScript.`); <br>
                
                }</p>
            </div>
            <p>خروجی</p>
            <div class="code">
                <p>I love JavaScript. <br>
                
                I love JavaScript. <br>
                
                I love JavaScript. <br>
                
                I love JavaScript. <br>
                
                I love JavaScript.</p>
            </div>
            <p>در جدول زیر مراحل و شیوه کار برنامه بالا توضیح داده شده است:</p>
            <table cellspacing=0 class="table">
                <tr>
                    <th>عمل</th>
                    <th>شرط: i <= n	</th>
                    <th>متغیر </th>
                    <th>شماره تکرار</th>
                </tr>
                <tr>
                    <td>متن I love JavaScript چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۲ افزایش می یابد. </td>
                    <td>true</td>
                    <td>i = 1 <br> n = 5</td>
                    <td>اول</td>
                </tr>
                <tr>
                    <td>متن I love JavaScript چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۳ افزایش می یابد.</td>
                    <td>true</td>
                    <td>i = 2 <br>
                    n = 5</td>
                    <td>دوم</td>
                </tr>
                <tr>
                    <td>متن I love JavaScript چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۴ افزایش می یابد.
                    
                    </td>
                    <td>true</td>
                    <td>i = 3 <br>
                    n = 5	</td>
                    <td>سوم</td> 
                </tr>
                <tr>
                    <td>متن I love JavaScript چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۵ افزایش می یابد.</td>
                    <td>true</td>
                    <td>i = 4 <br>
                    n = 5	</td>
                    <td>چهارم</td>
                </tr>
                <tr>
                    <td>متن I love JavaScript چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۶ افزایش می یابد.
                    
                    </td>
                    <td>true</td>
                    <td>i = 5 <br>
                    n = 5	</td>
                    <td>پنجم</td>
                </tr>
                <tr>
                    <td>حلقه تمام می شود.</td>
                    <td>false</td>
                    <td>i = 6 <br>
                    n = 5</td>
                    <td>ششم</td>
                </tr>
            </table>
            <p>مثال ۲: نمایش اعداد ۱ تا ۵</p>
            <div class="code">
                <p>// برنامه نمایش اعداد از ۱ تا ۵ <br>
                
                let n = 5; <br>
                
                // تا ۵ تکرار می شود i = 1 حلقه از <br>
                
                // یک واحد افزایش می یابدi در هر تکرار حلقه، متغیر <br>
                
                for (let i = 1; i <= n; i++) { <br>
                
                console.log(i); // چاپ می شودi مقدار <br>
                
                }</p>
            </div>
            <p>خروجی</p>
            <div class="code">
                <p>۱ <br>
                
                ۲ <br>
                
                ۳ <br>
                
                ۴ <br>
                
                ۵</p>
            </div>
            <p>در جدول زیر مراحل و شیوه کار برنامه بالا توضیح داده شده است:</p>
            <table cellspacing=0 class="table">
                <tr>
                    <th>عمل</th>
                    <th>شرط: i <= n	</th>
                    <th>متغیر </th>
                    <th>شماره تکرار</th>
                </tr>
                <tr>
                    <td>۱ چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۲ افزایش می یابد. </td>
                    <td>true</td>
                    <td>i = 1 <br> n = 5</td>
                    <td>اول</td>
                </tr>
                <tr>
                    <td>۲ چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۳ افزایش می یابد.</td>
                    <td>true</td>
                    <td>i = 2 <br>
                    n = 5</td>
                    <td>دوم</td>
                </tr>
                <tr>
                    <td>۳ چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۴ افزایش می یابد.
                    </td>
                    <td>true</td>
                    <td>i = 3 <br>
                    n = 5	</td>
                    <td>سوم</td> 
                </tr>
                <tr>
                    <td>۴ چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۵ افزایش می یابد.</td>
                    <td>true</td>
                    <td>i = 4 <br>
                    n = 5	</td>
                    <td>چهارم</td>
                </tr>
                <tr>
                    <td>۵ چاپ می شود.<br>
                    مقدار متغیر i به مقدار ۶ افزایش می یابد.
                    </td>
                    <td>true</td>
                    <td>i = 5 <br>
                    n = 5	</td>
                    <td>پنجم</td>
                </tr>
                <tr>
                    <td>حلقه تمام می شود.</td>
                    <td>false</td>
                    <td>i = 6 <br>
                    n = 5</td>
                    <td>ششم</td>
                </tr>
            </table>
            <p>مثال ۳: محاسبه و نمایش مجموع n عدد طبیعی</p>
            <div class="code">
                <p>//برنامه نمایش مجموع اعداد طبیعی از ۱ تا ۱۰۰  <br>
                
                let sum = 0; <br>
                
                let n = 100 <br>
                
                // تکرار می شود n=100 تا i = 1 حلقه از <br>
                
                // یک واحد افزایش می یابدi در هر تکرار حلقه، متغیر <br>
                
                for (let i = 1; i <= n; i++) { <br>
                
                sum += i; // sum = sum + i <br>
                
                } <br>
                
                console.log(‘sum:’, sum);</p>
            </div>
            <p>خروجی</p>
            <div class="code">
                <p> 5050</p>
            </div>
            <p>در این مثال متغیر sum برای محاسبه مجموع می باشد که مقدار اولیه آن برابر با ۰ است و متغیر n هم تعداد اعداد (تکرار حلقه) را ذخیره می کند. حلقه for از i = 1 تا ۱۰۰ تکرار می شود. در هر تکرار، متعیر i به مقدار قبلی متغیر sum اضافه می شود سپس در عبارت به روزرسانی متغیر i یک واحد افزایش می یابد.</p>
            <p>هنگامی که مقدار متغیر i برابر با ۱۰۱ شود، شرط حلقه نادرست می شود و مجموع اعداد در متغیر sum برابر با ۰ + ۱ + ۲ + … + ۱۰۰ خواهد بود.</p>
            <p>برنامه بالا به شکل زیر نیز نوشته می شود:</p>
            <div class="code">
                <p>//برنامه نمایش مجموع اعداد طبیعی از ۱ تا ۱۰۰ <br>
                
                let sum = 0; <br>
                
                let n = 100; <br>
                
                // تا ۱ تکرار می شود i = n حلقه از <br>
                
                // یک واحد کاهش می یابدi در هر تکرار حلقه، متغیر <br>
                
                for(let i = n; i >= 1; i– ) { <br>
                
                // adding i to sum in each iteration <br>
                
                sum += i; // sum = sum + i <br>
                
                } <br>
                
                console.log(‘sum:’,sum);</p>
            </div>
            <p>خروجی این برنامه مشابه مثال ۳ می باشد. در برنامه نویسی می توانید یک کار را به روش های مختلف انجام دهید.</p>
            <p>گرچه هر دو روش صحیح است اما باید سعی کنید روشی را انتخاب کنید که کدتان خوانایی بیشتری داشته باشد.</p>
            <h1>حلقه for بی نهایت در جاوا اسکریپت</h1>
            <p>اگر شرط حلقه for همیشه درست باشد در نتیجه حلقه تا بی نهایت اجرا می شود (تا زمانی که حافظه پر شود). مثال،</p>
            <div class="code">
                <p>// حلقه بی نهایت <br>
                
                for(let i = 1; i > 0; i++) { <br>
                
                // بلوک کد <br>
                
                }</p>
            </div>
            <p>در این برنامه شرط همیشه درست است و کد نامحدود اجرا می شود.</p>
        </div>
    </section>

    <!-- comment section -->

<?php include 'footer.php';?>