<?php
require 'config.php';
$_SESSION['url'] = $_SERVER['REQUEST_URI'];
?>
<!DOCTYPE html>
<html dir="rtl" lang="fa-IR">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Home</title>

    <!-- swiper css link -->
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/swiper@9/swiper-bundle.min.css" />

    <!-- font awesome cdn link -->
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">

    <link rel="stylesheet" href="css/style.css">

</head>

<body>

    <!-- header -->

    <section class="header">

        <a href="home.php" class="logo">آموزش جاوا اسکریپت</a>

        <nav class="navbar">
            <a href="home.php">صفحه اصلی</a>
            <a href="headlines.php">سرفصل ها</a>
            <a href="tests.php">آزمون ها</a>
            <a href="about.php">درباره ما</a>
            <?php
            if (!empty($_SESSION["id"])) {
                echo "<a href=logout.php>خروج</a>";
            } else {
                echo "<a href=login.php>ورود|ثبت نام</a>";
            }
            ?>
        </nav>

        <div id="menu-btn" class="fas fa-bars"></div>
    </section>

    <!-- header -->

    <!-- slider section -->

    <section class="home">

        <div class="swiper home-slider">

            <div class="swiper-wrapper">

                <div class="swiper-slide slide" style="background: url(images/s1.png) no-repeat">
                    <div class="content">
                        <span>از آموزش تا کسب درآمد</span>
                        <h3>آموزش جاوا اسکریپت به صورت کاملا رایگان</h3>
                        <a href="headlines.php" class="btn">شروع یادگیری</a>
                    </div>
                </div>

                <div class="swiper-slide slide" style="background: url(images/s2.jpg) no-repeat">
                    <div class="content">
                        <span>از آموزش تا کسب درآمد</span>
                        <h3>دسترسی به مطالب در هر زمان و در هر مکان</h3>
                        <a href="headlines.php" class="btn">شروع یادگیری</a>
                    </div>
                </div>

                <div class="swiper-slide slide" style="background: url(images/s3.jpg) no-repeat">
                    <div class="content">
                        <span>از آموزش تا کسب درآمد</span>
                        <h3>استفاده از متد های آموزشی روز دنیا</h3>
                        <a href="headlines.php" class="btn">شروع یادگیری</a>
                    </div>
                </div>

            </div>

            <div class="swiper-button-next"></div>
            <div class="swiper-button-prev"></div>

        </div>
    </section>

    <!-- slider section -->

    <!-- what is javascript -->

    <section class="main-content">
        <div class="content">
            <h1>آموزش جامع جاوا اسکریپت (JavaScript)</h1>
            <p>زبان برنامه‌نویسی جاوا اسکریپت یکی از محبوب‌ترین زبان‌های برنامه‌نویسی برای طراحی و توسعه وب است که امروزه در بسیاری از کشورهای دنیا مورداستفاده قرار می‌گیرد. این زبان ویژگی‌های زیادی را در اختیار توسعه‌دهندگان قرار می‌دهد که توسعه وب‌سایت‌های مختلف را برای آنها راحت‌تر می‌کند. آموزش جامع جاوا اسکریپت (JavaScript) یکی از بهترین و جذاب‌ترین آموزش‌هایی است که در این زمینه وجود دارد و می‌تواند به شما کمک کند تا مفاهیم پایه‌ای تا پیشرفته این زبان برنامه‌نویسی را بیاموزید.

                با استفاده از این آموزش شما می‌توانید اطلاعات موردنیاز برای ساخت وب‌سایت‌ها و برنامه‌های تحت وب با استفاده از زبان برنامه‌نویسی جاوا اسکریپت را به دست بیاورید و به بهترین شکل ممکن از این زبان استفاده کنید. اگر شما هم علاقه‌مند هستید تا اطلاعات خود را درباره این دوره آموزشی و ویژگی‌های آن افزایش دهید به شما پیشنهاد می‌کنیم حتما ادامه این مطلب را بادقت مطالعه کنید. در این مطلب قصد داریم اطلاعات جامع و کاملی درباره دوره آموزش کامل جاوا اسکریپت در اختیار شما علاقه‌مندان قرار دهیم.</p>
        </div>
    </section>

    <section class="main-content2">
        <div class="content">
            <h1>چرا باید زبان جاوا اسکریپت را انتخاب کنیم؟</h1>
            <p>احتمالا این سوال برای بسیاری از افرادی که به‌تازگی قصد انتخاب این زبان را دارند پیش‌آمده است. در پاسخ به این سوال می‌توان موارد متعددی را بیان کرد که ما در این بخش برخی از آنها را بیان می‌کنیم. یکی از مهم‌ترین دلایل انتخاب این زبان این است که شما می‌توانید هم برای سمت کاربر و هم برای سمت سرور کدنویسی کنید. این زبان برنامه‌نویسی فریم‌ورک‌ها و کتابخانه‌های متعددی را در اختیار شما قرار می‌دهد که کدنویسی و برنامه‌نویسی برای سمت سرور و سمت کاربر را برای شما بسیار ساده‌تر می‌کند. با استفاده از آموزش جامع جاوا اسکریپت (JavaScript) شما می‌توانید به مفاهیم پایه‌ای برای استفاده از این کتابخانه‌ها و فریم‌ورک‌ها مسلط شوید.
                دلیل بسیار مهم دیگری که برای یادگیری این زبان برنامه‌نویسی وجود دارد این است که در حال حاضر بسیاری از شرکت‌های داخلی از این زبان برای انجام پروژه‌های خود استفاده می‌کنند. پس شما می‌توانید با یادگیری آن به‌راحتی مشغول به کار شوید و درآمد بالایی نیز داشته باشید. جاوا اسکریپت دارای جامعه توسعه‌دهندگان بسیار گسترده‌ای است. به همین علت اگر در طول یادگیری یا انجام پروژه‌ها سوال یا چالشی برای شما به وجود بیاید می‌توانید به‌سادگی هرچه تمام به پاسخ آن دست پیدا کنید.</p>
        </div>
    </section>

    <!-- libraries section -->

    <section class="libraries">

        <h1 class="heading-title">معرفی مهمترین و پرکاربردترین فریمورک و کتابخانه های جاوا اسکریپت</h1>

        <div class="box-container">

            <div class="box">
                <img src="images/jquery.png" alt="">
                <h3>JQuery</h3>
            </div>

            <div class="box">
                <img src="images/bootstrap.png" alt="">
                <h3>Bootstrap</h3>
            </div>

            <div class="box">
                <img src="images/vue.png" alt="">
                <h3>Vue.js</h3>
            </div>

            <div class="box">
                <img src="images/node.png" alt="">
                <h3>Node.js</h3>
            </div>

            <div class="box">
                <img src="images/react.png" alt="">
                <h3>React</h3>
            </div>

            <div class="box">
                <img src="images/angular.png" alt="">
                <h3>Angular</h3>
            </div>

        </div>

    </section>

    <!-- libraries section -->

    <section class="home-about">

        <div class="image">
            <img src="images/img1.jpg" alt="">
        </div>

        <div class="content">
            <h3>ویژگی‌های دوره</h3>
            <p>دوره آموزش کامل جاوا اسکریپت توسط یکی از بهترین اساتید کشوری در این زمینه تهیه شده است که استفاده از آن می‌تواند هم برای افراد مبتدی و هم برای افرادی که در سطح پیشرفته قرار دارند بسیار مفید و کاربردی باشد. نکته مهمی که درباره این آموزش باید به آن دقت داشته باشید این است که در این آموزش تمامی مهارت‌های ابتدایی به طور کامل به شما آموزش داده می‌شود و پس از اتمام این دوره شما آماده ورود به حوزه‌های مختلفی که در زمینه این زبان برنامه‌نویسی وجود دارند خواهید بود.</p>
            <p>بدون شک یکی از مهم‌ترین ویژگی‌های آموزش جامع جاوا اسکریپت (JavaScript) این است که تمامی مطالب را به ساده‌ترین زبان ممکن به شما آموزش داده است و استفاده از آن برای افرادی که هیچ‌دانشی در زمینه برنامه‌نویسی ندارند نیز امکان‌پذیر است. ویژگی کلیدی و بسیار مهم دیگر این آموزش این است که شما به‌صورت کاملا رایگان می‌توانید به تمام محتوای آموزشی آن دسترسی داشته باشید و نیازی نیست که هزینه زیادی را برای یادگیری این زبان صرف کنید.</p>
            <a href="login.php" class="btn">همین الان ثبت نام کنید</a>
        </div>

    </section>

    <section class="main-content">
        <div class="content">
            <h1>مسیر یادگیری زبان برنامه‌نویسی جاوا اسکریپت</h1>
            <p>پیش از هر چیز باید بدانید که زبان برنامه‌نویسی جاوا اسکریپت یک زبان برنامه‌نویسی همه‌کاره است و شما می‌توانید برای برنامه‌نویسی تحت وب به شکل‌های مختلفی از این زبان و فریم‌ورک‌های مختلف آن استفاده کنید. اگر قصد دارید در آینده به‌عنوان یک برنامه‌نویسی فرانت‌اند یا بک‌اند یا یک برنامه‌نویس فول‌استک فعالیت داشته باشید درهرصورت باید مبانی پایه‌ای این زبان برنامه‌نویسی را بیاموزید. برای این کارآموزش جامع جاوا اسکریپت (JavaScript) می‌تواند بهترین گزینه‌ای باشد که پیش‌روی شما قرار دارد. با استفاده از این آموزش می‌توانید تمامی مطالب پایه‌ای را با بهترین کیفیت آموزشی ممکن بیاموزید.</p>
            <p>در ادامه شما باید یکی از فریم‌ورک‌های مختلفی که در این زبان وجود دارند را انتخاب کنید تا بتوانید به‌صورت تخصصی کارکردن با این زبان را ادامه دهید. هریک از فریم‌ورک‌های مختلف این زبان برنامه‌نویسی دارای کاربردها و ویژگی‌های مخصوص به خود هستند. از جمله مهم‌ترین این فریم‌ورک‌ها می‌توان به Node.js اشاره کرد که امروزه در بسیاری از سازمان‌ها و کسب‌وکارهای مختلف استفاده می‌شود. دقت داشته باشید که دوره‌های مربوط به هریک از این فریم‌ورک‌ها نیز در سایت ما موجود است که در صورت تمایل می‌توانید از آنها استفاده کنید.</p>
            <h1>صحبت پایانی</h1>
            <p>آموزش جامع جاوا اسکریپت (JavaScript) یکی از بهترین دوره‌های آموزشی زبان برنامه‌نویسی جاوا اسکریپت است که تمامی مطالب را به‌صورت جامع و کامل به شما آموزش می‌دهد. کیفیت بالای آموزشی، رایگان بودن و ... از مهم‌ترین ویژگی‌های این دوره آموزشی به شمار می‌آیند. پس درنگ نکنید و همین حالا مسیر خود برای تبدیل‌شدن به یک توسعه‌دهنده زبان برنامه‌نویسی جاوا اسکریپت را آغاز کنید. به شما پیشنهاد می‌کنیم از سایر دوره‌های آموزشی ما نیز نهایت بهره را ببرید.</p>
        </div>
    </section>

    <!-- what is javascript -->

    <?php include 'footer.php'; ?>